# FilterType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..FilterType Property
ScheduleFilter Class See Also
---
The filter type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleFilterType FilterType { get; set; }
```

Visual Basic
---
```text
Public Property FilterType As ScheduleFilterType
	Get
	Set
```

Visual C++
---
```text
public:
property ScheduleFilterType FilterType {
	ScheduleFilterType get ();
	void set (ScheduleFilterType value);
}
```

# Remarks
See ScheduleFilterType for details.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace